print('Дано:')
x = int(input('Ш. конфеты(кг) X = '))
a = int(input('Их цена(руб.) A = '))
y = int(input('Ириски(кг) Y = '))
b = int(input('Их цена(руб.) B = '))
a1 = round(a / x, 2) # цена 1кг ш. конфет
b1 = round(b / y, 2) # цена 1кг ирисок
print('Решение:')
print('1кг ш. конфет = ', a1)
print('1кг ирисок = ', b1)
if (a1 > b1): # разница цен ш. конфет и ирисок
    c = round(a1 / b1, 2)
    print('Ш. конфеты дороже ирисок в ', c, ' раз(-а)')
else :
    c = round(b1 / a1, 2)
    print('Ириски дороже ш. конфет в ', c, ' раз(-а)')
print('X, A, Y или B не равны 0!')
